Revit 2027 API
RoutingConditions.ErrorLevel Property
 The error level that the routing preference manager should post errors if the routing conditions do not meet any routing preference rule, could be None, Warning, or Error
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RoutingPreferenceErrorLevel ErrorLevel { get; set; }
Public Property ErrorLevel As RoutingPreferenceErrorLevel
	Get
	Set
public:
property RoutingPreferenceErrorLevel ErrorLevel {
	RoutingPreferenceErrorLevel get ();
	void set (RoutingPreferenceErrorLevel value);
}
member ErrorLevel : RoutingPreferenceErrorLevel with get, set
Property Value
RoutingPreferenceErrorLevel
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RoutingConditions Class
Autodesk.Revit.DB Namespace